; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	infrared5 - mode
	image6 - mode
	spectrograph7 - mode
	thermograph1 - mode
	thermograph0 - mode
	thermograph3 - mode
	thermograph2 - mode
	infrared4 - mode
	GroundStation2 - direction
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation0 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph1)
	(supports instrument1 image6)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared4)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument5 infrared5)
	(supports instrument5 infrared4)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared5)
	(supports instrument6 image6)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star4)
	(supports instrument8 spectrograph7)
	(supports instrument8 image6)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star3)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph3)
	(supports instrument10 spectrograph7)
	(calibration_target instrument10 Star4)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(pointing satellite4 Planet8)
	(have_image Planet5 thermograph2)
	(have_image Star6 image6)
	(have_image Phenomenon7 image6)
	(have_image Phenomenon7 infrared4)
	(have_image Planet8 thermograph3)
	(have_image Planet8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Star10 infrared4)
	(have_image Star10 thermograph0)
	(have_image Planet11 infrared5)
	(have_image Planet11 spectrograph7)
))

)

; plan
1. (turn_to satellite4 star4 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star4)
   goals met: 0 of 13
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 13
3. (calibrate satellite4 instrument10 star4)
   added: (calibrated instrument10)
   goals met: 0 of 13
4. (turn_to satellite4 star10 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star10)
   goals met: 0 of 13
5. (take_image satellite4 star10 instrument10 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 1 of 13
6. (turn_to satellite4 planet11 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 planet11)
   goals met: 1 of 13
7. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 13
8. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 13
9. (turn_to satellite1 star10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star10)
   goals met: 1 of 13
10. (take_image satellite1 star10 instrument4 infrared4)
   added: (have_image star10 infrared4)
   goals met: 2 of 13
11. (turn_to satellite1 planet5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet5)
   goals met: 2 of 13
12. (take_image satellite1 planet5 instrument4 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 3 of 13
13. (turn_to satellite1 phenomenon7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 13
14. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 13
15. (take_image satellite4 planet11 instrument10 spectrograph7)
   added: (have_image planet11 spectrograph7)
   goals met: 4 of 13
16. (take_image satellite1 phenomenon7 instrument4 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 5 of 13
17. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 13
18. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 5 of 13
19. (turn_to satellite0 phenomenon7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 13
20. (take_image satellite0 phenomenon7 instrument1 image6)
   added: (have_image phenomenon7 image6)
   goals met: 6 of 13
21. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 6 of 13
22. (take_image satellite0 planet11 instrument1 infrared5)
   added: (have_image planet11 infrared5)
   goals met: 7 of 13
23. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 7 of 13
24. (take_image satellite0 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 8 of 13
25. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 8 of 13
26. (take_image satellite0 planet9 instrument1 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 9 of 13
27. (turn_to satellite0 star6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star6)
   goals met: 9 of 13
28. (take_image satellite0 star6 instrument1 image6)
   added: (have_image star6 image6)
   goals met: 10 of 13
29. (turn_to satellite2 groundstation2 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation2)
   goals met: 11 of 13
30. (turn_to satellite4 planet8 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet8)
   goals met: 12 of 13
31. (take_image satellite4 planet8 instrument10 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 13 of 13
